# RiseDropAnnotationSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..RiseDropAnnotationSize Property
DuctSettings Class See Also
---
The rise drop annotation size.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double RiseDropAnnotationSize { get; set; }
```

Visual Basic
---
```text
Public Property RiseDropAnnotationSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double RiseDropAnnotationSize {
	double get ();
	void set (double value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace